<?php
ini_set('display_errors',1);
Error_Reporting(E_ALL & ~E_NOTICE);

$di=$_POST["di"];
$ech=$_POST["ech"];
$ip = $_SERVER["REMOTE_ADDR"];



$locale = "http://10.43.161.214";

//127.0.0.1 10.43.161.235 10.43.161.211 10.43.161.214 10.43.161.230 10.43.161.231 - эчц-1
// $diech = "$di$ech"; 10.43.161.214 10.43.161.214
	
unset ($ban);

//Руководство Э, дисп.Э - выбор ЭЧ
$echvibor=$_POST["echvibor"];
$users = "10.43.249.9 10.43.249.140 10.43.242.32 10.43.83.167 10.43.20.18 10.43.161.4.0000 10.43.161.26 10.42.92.28 10.43.161.26";

// 10.43.161.4.0000, 10.42.92.28(с 08.05.18) - Воробьев
// 10.43.161.26 - Кукушкин
	// if ($ip == "10.43.249.9"){$neispravnosti="";}; //Налётов А.А.
	// if ($ip == "10.43.249.140"){$neispravnosti="";}; //Балдин А.Н.
	
settype($ip,string);
$sovpad=substr_count($users, $ip);
if ($sovpad!=""){
	$rukovoditel=1;
	$di = "di_01";
	if ($echvibor==""){
		unset ($cok1);
		$cok1 = ($_COOKIE[ech]);
		if ($cok1 !=""){
				$ech = $cok1;
				//echo "ЭЧ -- $ech !";
				//setcookie ("ech", "");
		}else{
			//Читаем папку Дирекции
			//получаем список файлов каталога
			$dir = "./$di/";
			if (file_exists($dir)){
				$dir = opendir ("$dir");
				while ( $file = readdir ($dir)){
						if (( $file != ".") && ($file != "..")){
							$dirs[] = $file;
							$n_cehov++;
						};
				};
				closedir ($dir);
				//print_r ($dirs);
				echo "<html><head></head><body>
				</br>Всего $n_cehov ЭЧ подключены к программе !</br>Необходимо выбрать ЭЧ:<br>";// возвращаем число папок
			};
			//выводим кнопки выбора ЭЧ
			echo "<table><tr>";
			for ($i=0;$i < count($dirs); $i++){
				//unset ($cehrus, $ceh);
				$ech = "$dirs[$i]";
				//include "cehrename.php";
				echo "<td align='center'>
				<form method='post' action='index.html'>
				<INPUT TYPE=hidden NAME='echvibor' VALUE='$ech'>
				<INPUT class='green goodbutton' TYPE=submit VALUE='$ech'>  
				</form></td>
				";
				if ($n > 7){
					echo "</tr><tr>";
					$n=0;
				}else{$n++;};
			};
			echo "</tr></table></body></html>";
			unset ($dirs, $ech);
			exit;
		}
	}else{
		$ech = $echvibor;
	}
	$ban = 1;
	// echo "Дирекция: $di, ЭЧ: $ech.</br>";
};



if ($di =="" or $ech ==""){
// Северная ДИ ЭЧ-1(di01ech01) 
	$users = "10.43.161.224 10.43.161.231 10.43.161.230 10.43.161.213 10.43.166.87 10.43.161.235 10.43.161.7 10.43.166.069 10.43.166.69 10.43.161.211 10.43.166.66 10.43.166.67 10.43.166.68 10.43.166.69 10.43.166.70 10.43.166.71 10.43.166.72 10.43.166.73 10.43.166.74 10.43.166.75 10.43.166.76 10.43.166.127 10.40.68.10 10.40.68.82 10.40.68.114 10.40.68.115 10.40.68.98 10.43.174.173 10.40.81.107 10.43.153.146 10.43.153.147 10.43.153.148 10.40.7.139 10.40.7.140 10.40.106.91 10.40.106.72 10.40.67.42 10.40.67.90 10.40.67.26 10.43.170.252 10.40.81.21 10.43.153.155 10.43.144.50 10.40.106.90 10.43.175.215 10.43.140.165 10.43.140.167 10.40.99.18 10.40.99.20 10.40.99.22 10.40.4.131 10.40.4.130 10.40.67.27 10.43.161.235 10.43.175.211 10.43.175.213 10.43.166.102 10.43.166.103 10.43.166.104 10.43.166.107 10.43.166.66 10.43.166.67 10.43.166.68 10.43.166.69 10.43.166.71 10.43.166.73 10.43.166.77 10.43.166.78 10.43.166.79 10.43.166.81 10.43.166.83 10.43.166.84 10.43.166.85 10.43.166.86 10.43.166.88 10.43.166.89 10.43.166.90 10.43.166.91 10.43.166.93 10.43.166.94 10.43.166.97 10.43.166.98 10.43.166.99 10.43.161.213 10.43.140.166 10.43.140.169 10.40.67.12 10.43.236.222 10.40.106.178 10.40.68.83 10.40.7.194 10.40.67.66 10.40.106.85 10.43.236.221 10.43.164.136 10.43.164.173 10.43.164.151 10.40.81.106";

	// 10.43.166.87 - нач ЭЧ-1
	// 10.43.164.136 Вржес 10.43.164.173 Перфильев 10.43.164.151 Паничев
	//ищем совпадение
	settype($ip,string);
	$sovpad=substr_count($users, $ip);

	
	if ($sovpad!="")
	{
		$ban = 1;
		$di = "di_01"; $ech = "ech01";
		// echo "Дирекция: $di, ЭЧ: $ech.</br>";
	};

// Северная ДИ ЭЧ-3(di01ech03)
	$users = "10.41.66.61 10.43.128.106 10.43.128.37 10.43.128.107 10.43.121.201 10.43.121.195 10.43.130.185 10.43.130.186 10.43.130.181 10.43.130.166 10.43.130.167 10.43.130.168 10.43.128.97 10.10.144.200 10.43.130.173 10.43.121.196 10.43.122.165 10.43.121.203 10.43.130.164 10.40.160.189 10.40.160.232 10.43.130.183 10.40.144.170 10.43.130.172 10.43.128.78 10.43.132.85 10.43.160.245 10.43.130.180 10.41.66.60 10.43.130.188 10.40.145.20 10.43.130.179 10.41.66.92 10.43.160.252 10.43.160.231 10.41.66.94 10.43.122.169 10.43.132.25 10.43.132.28 10.43.130.163 10.41.66.59 10.40.152.103 10.41.66.107 10.43.128.3 10.43.132.243 10.43.121.204 10.40.145.18 10.41.66.108 10.40.160.252 10.40.144.200 10.43.122.29 10.43.130.178 10.41.66.76 10.40.160.183 10.40.160.245 10.43.122.170 10.43.130.180 10.40.152.109 10.43.132.83 10.40.160.231 10.43.132.87 10.43.122.23 10.43.122.25";

	
	
	

	// 10.43.130.178 - нач. ЭЧ-3 Виноградов С.Н.
	//10.43.132.243 - Феофанов А.С.
	//10.43.121.204 - Бурков С.В.
	//10.40.145.18 - Качанов И.Н.
	//10.40.160.231 - Мягков В.М.
	//10.40.160.252 - Старостин Юрий Анатольевич 
	//10.41.66.108 - Смирнова Светлана Николаевна (ЭЧЭ-11)
	//10.40.160.252 Старостин Юрий Анатольевич
	//10.40.144.200 Румянцев Валентин Михайлович
	//10.43.122.29 Бойцов Олег Валентинович Тяговая подстанция ст. Шарья
	//10.41.66.76 Чернышов В.А.
	//10.40.160.245 Шашмурин Николай Павлович
	//10.40.160.183 Душин ЭЧК-30
	//10.43.122.170 Борисов Андрей Владимирович\
	//10.43.130.180 Веселов Михаил Николаевич
	//10.40.152.109 Карпов Сергей Юрьевич Электромеханик Тяговая подстанция станции Любим
	//10.43.132.83 Леонтьев Сергей Александрович
	// 10.43.122.23 10.43.122.25 - ЭЧК-14

	
	//ищем совпадение
	$sovpad=substr_count($users, $ip);
	
	if ($sovpad!="")
	{
		$ban = 1;
		$di = "di_01"; $ech = "ech03";
		// echo "Дирекция: $di, ЭЧ: $ech.</br>";
	};

// Северная ДИ ЭЧ-4(di01 ech04)
	$users = "10.43.99.17 10.43.99.35 10.43.105.8 10.43.96.177 10.43.99.38 10.43.99.36";
	
	//ищем совпадение


	settype($ip,string);
	$sovpad=substr_count($users, $ip);

	
	if ($sovpad!="")
	{
		$ban = 1;
		$di = "di_01"; $ech = "ech04";
		//echo "Дирекция: $di, ЭЧ: $ech.</br>";
	};	
	
// Северная ДИ ЭЧ-5(di01 ech05)190
	$users = "10.43.83.144 10.43.83.151 10.43.83.166 10.43.83.148 10.43.83.153 10.43.83.174 10.43.83.154 10.43.83.171 10.43.83.132 10.43.83.158 10.43.83.138 10.43.83.159 10.43.66.20 10.40.192.209 10.40.199.82 10.40.199.99 10.42.248.72 10.40.235.69 10.40.235.77 10.40.192.202 10.40.194.170 10.42.248.68 10.40.232.173 10.40.196.138 10.42.248.72 10.41.60.117 10.40.233.8 10.43.80.190";

	//ищем совпадение
	// 10.43.83.167 Лоншаков Валентин Владимирович [nee-LonshakovVV@nrr.rzd]
	settype($ip,string);
	$sovpad=substr_count($users, $ip);

	
	if ($sovpad!="")
	{
		$ban = 1;
		$di = "di_01"; $ech = "ech05";
		//echo "Дирекция: $di, ЭЧ: $ech.</br>";
	};
	
// Северная ДИ ЭЧ-6(di01 ech06)
	$users = "10.43.38.25 10.43.38.24 10.43.38.5 10.43.38.23 10.43.38.13 10.43.38.4 10.43.38.6 10.43.38.11 10.42.228.84 10.42.228.85 10.40.246.37 10.40.246.39 10.40.214.6 10.40.214.8 10.43.38.27 10.43.38.9 10.43.41.165 10.43.41.168 10.43.41.167 10.43.38.20 10.40.214.7";

	//ищем совпадение
	settype($ip,string);
	$sovpad=substr_count($users, $ip);

	
	if ($sovpad!="")
	{
		$ban = 1;
		$di = "di_01"; $ech = "ech06";
		//echo "Дирекция: $di, ЭЧ: $ech.</br>";
	};

// Северная ДИ ЭЧ-7(di01 ech07)
	$users = "10.43.20.23 10.43.20.17 10.43.24.89 10.43.20.19 10.43.20.29 10.43.71.36 10.43.71.35 10.41.28.101 10.41.28.102 10.41.24.175 10.41.28.232 10.41.28.231 10.43.20.32 10.43.20.2 10.43.20.20 10.41.36.2 10.41.36.3 10.41.36.4 10.43.21.68 10.43.21.71 10.43.21.70 10.41.28.106";

	//ищем совпадение
	//10.41.28.106 Маликов Иван Владимирович  Электромеханик Княжпогостский район электроснабжения

	settype($ip,string);
	$sovpad=substr_count($users, $ip);

	
	if ($sovpad!=""){
		$ban = 1;
		$di = "di_01"; $ech = "ech07";
		//echo "Дирекция: $di, ЭЧ: $ech.</br>";
	};

// Северная ДИ ЭЧ-8(di01 ech08)
	$users = "10.43.2.178 10.43.2.179 10.43.2.182 10.43.2.172 10.43.2.176 10.41.44.213 10.41.44.211 10.43.2.174 10.41.48.69 10.43.2.187 10.43.2.166 10.42.253.162 10.43.2.185";
	//ищем совпадение
	//10.43.2.185 Логинов Николай Борисович
	settype($ip,string);
	$sovpad=substr_count($users, $ip);

	
	if ($sovpad!=""){
		$ban = 1;
		$di = "di_01"; $ech = "ech08";
		//echo "Дирекция: $di, ЭЧ: $ech.</br>";
	};
	
// Северная ДИ ЭЧ-10(di01 ech10)
	$users = "10.43.72.213 10.43.72.198 10.43.72.197 10.43.72.211 10.43.72.201 10.43.72.217 10.43.74.252 10.43.72.196 10.43.72.210 10.43.72.200 10.43.72.208 10.43.72.199 10.42.208.178 10.43.72.203 10.42.208.180 10.43.72.209 10.43.74.253 10.43.74.250 10.43.74.251 10.43.74.245 10.43.74.243 10.43.72.202 10.43.74.240 10.43.72.205 10.41.160.5 10.43.74.244 10.42.208.181 10.41.160.12 10.42.208.179 10.41.160.12 10.43.72.208 10.42.208.178 10.43.72.217 10.43.74.252 10.43.72.211 10.43.72.210 10.42.208.179 10.43.74.243 10.43.72.202 10.42.208.180 10.41.160.5 10.43.74.245 10.43.72.198 10.43.74.250 10.43.74.253 10.43.74.244 10.42.208.181 217";

	//ищем совпадение
	//10.43.72.217 - ЭЧЦ
	//10.43.72.208 Баев В.А.
	//10.43.74.253 Уваров Д.А.
	//10.43.72.202 Маркелов О.Ю.
	//10.41.160.5 Ольшевский М.А.
	settype($ip,string);
	$sovpad=substr_count($users, $ip);

	
	if ($sovpad!=""){
		$ban = 1;
		$di = "di_01"; $ech = "ech10";
		//echo "Дирекция: $di, ЭЧ: $ech.</br>";
	};	
	
	
	//баним левых юзеров
	// if ($ban==""){
		// echo "У ВАС НЕТ ДОСТУПА!!! Ваш ip=$ip<br>Для получения доступа обращаться: <a href='mailto:di-PlyaskinEV@nrr.rzd'>di-PlyaskinEV@nrr.rzd</a>";
		// exit;
	// };
	
}else{
	//echo "Дирекция: $di, ЭЧ: $ech.</br>";
};

//Запрет редактирования

$users = "10.43.252.203 10.43.245.159 10.43.249.9";

	//ищем совпадение
	settype($ip,string);
	$sovpad=substr_count($users, $ip);

	
	if ($sovpad!="")
	{
		$zapretredact = 1;
	};	

//рус эч
$echrus = str_replace("ech","ЭЧ-",$ech);
if($ech =="ntel"){
	$echrus ="НТЭЛ";
}

	//пишем лог-файл
	include "date_functions.php";
	$logtime = "$year$mes";
	$log =  fopen ("./iplog$logtime.csv","a");
	if(!$log)
	  {
		echo("Ошибка открытия файла iplog.csv");
	  }
	$datetime = date("d.m.Y Время H:i:s");
	fputs ($log, $datetime);fputs ($log, "\n$ip, Дирекция:$di, $echrus\n");
	fclose ($log);










?>