<?php
ini_set('display_errors',1);
Error_Reporting(E_ALL & ~E_NOTICE);
include "config.php";
$titl = "VIDEO";
include "head.html";

//получаем список файлов каталога (video)

                $n_doc=0;
                $dir = opendir ("./video");
                while ( $file = readdir ($dir))
                {
                        if (( $file != ".") && ($file != ".."))
                                {
                                        $fils_doc[] = $file;
                                        $n_doc=$n_doc+1;
										sort ($fils_doc);
                                }
                };
                closedir ($dir);
				$n_doc2 = $n_doc/2;
				
				echo "<div ><p><span style='color:green;'><h4>ФИЛЬМЫ:</h4></span></p><table><tr><td>
					<table><tr>
					<td>
					<br/>
					<a href='http://10.43.161.231/video/2023.01.26 Шкафы ступенчатых защит управления выключателем 110 – 220 кВ. 1ч.mp4'>2023.01.26 Шкафы ступенчатых защит управления выключателем 110 – 220 кВ. 1ч.mp4</a><br/><br/>
					<a href='http://10.43.161.231/video/2023.01.26 Шкафы ступенчатых защит управления выключателем 110 – 220 кВ. 2ч.mp4'>2023.01.26 Шкафы ступенчатых защит управления выключателем 110 – 220 кВ. 2ч.mp4</a><br/><br/>
					<a href='http://10.43.161.231/video/2023.01.18 ТЭ Микропроцессорные ИнТер-27,5 часть 1.mp4'>2023.01.18 ТЭ Микропроцессорные ИнТер-27,5 часть 1.mp4</a><br/><br/>
					<a href='http://10.43.161.231/video/2023.01.18 ТЭ Микропроцессорные ИнТер-27,5 часть 2.mp4'>2023.01.18 ТЭ Микропроцессорные ИнТер-27,5 часть 2.mp4</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.11.23 РУ собственных нужд. Рекомендации по эксплуатации и обслуживанию (ТЭ).mp4'>2022.11.23 РУ собственных нужд. Рекомендации по эксплуатации и обслуживанию (ТЭ).mp4</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.10.12 ТЭ Тяговые распределительные устройства постоянного тока 3,3 кВ.mp4'>2022.10.12 ТЭ Тяговые распределительные устройства постоянного тока 3,3 кВ</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.10.26 ТЭ Оборудование электрообогрева стрелочных переводов-1.mp4'>2022.10.26 ТЭ Оборудование электрообогрева стрелочных переводов-1</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.10.26 ТЭ Оборудование электрообогрева стрелочных переводов-2.mp4'>2022.10.26 ТЭ Оборудование электрообогрева стрелочных переводов-2</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.11.02 ТЭ Микропроцессорная РЗА тяговых подстанций - 1.mp4'>2022.11.02 ТЭ Микропроцессорная РЗА тяговых подстанций - 1</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.11.02 ТЭ Микропроцессорная РЗА тяговых подстанций - 2.mp4'>2022.11.02 ТЭ Микропроцессорная РЗА тяговых подстанций - 2</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.08.03 ТЭ Оборудование пунктов группировки станций стыкования.mp4'>2022.08.03 ТЭ Оборудование пунктов группировки станций стыкования</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.07.20 ТЭ ИнТер-3,3 (Часть 1).mp4'>2022.07.20 ТЭ ИнТер-3,3 (Часть 1)</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.07.20 ТЭ ИнТер-3,3 (Часть 2).mp4'>2022.07.20 ТЭ ИнТер-3,3 (Часть 2)</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.03.16 ТЭ Элегазовое оборудование 110 и 220 кВ.mp4'>2022.03.16 ТЭ Элегазовое оборудование 110 и 220 кВ</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.08.17 ТЭ БВ постоянного тока.mp4'>2022.08.17 ТЭ БВ постоянного тока</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.09.14 ТЭ Вольтодобавочные устройства постоянного тока ч1.mp4'>2022.09.14 ТЭ Вольтодобавочные устройства постоянного тока ч1</a><br/><br/>
					<a href='http://10.43.161.231/video/2022.09.14 ТЭ Вольтодобавочные устройства постоянного тока ч2.mp4'>2022.09.14 ТЭ Вольтодобавочные устройства постоянного тока ч2</a><br/><br/>
					";
					
					
				
				for($i=0; $i < $n_doc2; $i++)
				{
						echo "<a href='video/$fils_doc[$i]'>$fils_doc[$i]</a><br/><br/>";
						
				}
				echo "</td>";
				echo "<td>";
				for($i=$i; $i < $n_doc; $i++)
				{
						echo "<a href='video/$fils_doc[$i]'>$fils_doc[$i]</a><br/><br/>";
				}
				echo "</td></tr></table>";
				unset ($fils_doc);

				
				
				
				
				
				
echo "</div></body></html>"
?>